OdDAI.ADB_Value.op_Implicit~System.Double!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced
\details
The cast to double operator for the attribute data block value object.
\returns
The attribute data block value converted to a double value.
If the attribute data block value can't be converted into the double data type, the operator throws an exception.